Revit 2027 API
BuiltInFailures.AssemblyFailures.NoElementsAddedtoNewAssembly Property
 No elements were added to the assembly. No assembly will be created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoElementsAddedtoNewAssembly { get; }
Public Shared ReadOnly Property NoElementsAddedtoNewAssembly As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoElementsAddedtoNewAssembly {
	FailureDefinitionId^ get ();
}
static member NoElementsAddedtoNewAssembly : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AssemblyFailures Class
Autodesk.Revit.DB Namespace